src/Documents/ПереоценкаВалютныхСтатейМеждународный/ПереоценкаВалютныхСтатейМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереоценкаВалютныхСтатейМеждународный</name>
  <comment>(Упр)</comment>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходовОтКурсовыхРазниц</name>
    <type>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовОтКурсовыхРазниц</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
</mdclass:Document>

src/AccountingRegisters/Международный/Международный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Международный</name>
  <comment>(Упр)</comment>
  <chartOfAccounts>ChartOfAccounts.Международный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервичныйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

src/InformationRegisters/СчетаСОсобымПорядкомПереоценкиМеждународный/СчетаСОсобымПорядкомПереоценкиМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СчетаСОсобымПорядкомПереоценкиМеждународный</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СчетДоходовОтКурсовыхРазниц</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоДоходов1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоДоходов2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоДоходов3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СчетРасходовОтКурсовыхРазниц</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоРасходов1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоРасходов2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоРасходов3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/ChartsOfCharacteristicTypes/ВидыСубконтоМеждународные/ВидыСубконтоМеждународные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконтоМеждународные</name>
  <comment>(Упр)</comment>
  <type>
    <types>CatalogRef.Налоги</types>
    <types>CatalogRef.НоменклатурныеГруппы</types>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>CatalogRef.СтатьиНеоперационныхРасходов</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>CatalogRef.НематериальныеАктивы</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.ВидыФинРезервов</types>
    <types>CatalogRef.РасходыБудущихПериодов</types>
    <types>CatalogRef.БанковскиеСчета</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.Кассы</types>
    <types>CatalogRef.СтатьиДоходов</types>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.Субконто</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>CatalogRef.Склады</types>
  </type>
  <predefined>
    <items>
      <name>БанковскиеСчета</name>
      <description>Банковские счета</description>
      <code>00000000008</code>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </items>
    <items>
      <name>ВнеоборотныеАктивы</name>
      <description>Внеоборотные активы</description>
      <code>00000000011</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>00000000024</code>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>00000000005</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Налоги</name>
      <description>Налоги</description>
      <code>00000000032</code>
      <type>
        <types>CatalogRef.Налоги</types>
      </type>
    </items>
    <items>
      <name>НематериальныеАктивы</name>
      <description>Нематериальные активы</description>
      <code>00000000006</code>
      <type>
        <types>CatalogRef.НематериальныеАктивы</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>00000000001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>НоменклатурныеГруппы</name>
      <description>Номенклатурные группы</description>
      <code>00000000020</code>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </items>
    <items>
      <name>ОбособленныеПодразделения</name>
      <description>Обособленные подразделения</description>
      <code>00000000030</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ОбъектыСтроительства</name>
      <description>Объекты строительства</description>
      <code>00000000002</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>00000000004</code>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </items>
    <items>
      <name>Подразделения</name>
      <description>Подразделения</description>
      <code>00000000017</code>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </items>
    <items>
      <name>РаботникиОрганизации</name>
      <description>РаботникиОрганизации</description>
      <code>00000000003</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>00000000015</code>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </items>
    <items>
      <name>Резервы</name>
      <description>Резервы</description>
      <code>00000000018</code>
      <type>
        <types>CatalogRef.ВидыФинРезервов</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>00000000033</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
      <code>00000000023</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>СтатьиДоходов</name>
      <description>Статьи доходов</description>
      <code>00000000031</code>
      <type>
        <types>CatalogRef.СтатьиДоходов</types>
      </type>
    </items>
    <items>
      <name>СтатьиЗатрат</name>
      <description>Статьи затрат</description>
      <code>00000000007</code>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </items>
    <items>
      <name>СтатьиНеоперационныхРасходов</name>
      <description>Статьи неоперационных расходов</description>
      <code>00000000009</code>
      <type>
        <types>CatalogRef.СтатьиНеоперационныхРасходов</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

src/Documents/ПереоценкаВалютныхСтатейМеждународный/ObjectModule.bsl
Перем мУдалятьДвижения;

Перем мВалютаРегламентированногоУчета Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецЕсли

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МеждународныйОстатки.Счет,
	               |	МеждународныйОстатки.Субконто1,
	               |	МеждународныйОстатки.Субконто2,
	               |	МеждународныйОстатки.Субконто3,
	               |	СУММА(МеждународныйОстатки.ВалютнаяСуммаОстатокДт) КАК ВалютнаяСуммаОстатокДт,
	               |	СУММА(МеждународныйОстатки.ВалютнаяСуммаОстатокКт) КАК ВалютнаяСуммаОстатокКт,
	               |	СУММА(МеждународныйОстатки.СуммаОстатокДт) КАК СуммаОстатокДт,
	               |	СУММА(МеждународныйОстатки.СуммаОстатокКт) КАК СуммаОстатокКт,
	               |	МеждународныйОстатки.Валюта
	               |ИЗ
	               |	РегистрБухгалтерии.Международный.Остатки(&ПериодКонец, Счет.Валютный = &Истина, , Организация = &Организация) КАК МеждународныйОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	МеждународныйОстатки.Счет,
	               |	МеждународныйОстатки.Субконто1,
	               |	МеждународныйОстатки.Субконто2,
	               |	МеждународныйОстатки.Субконто3,
	               |	МеждународныйОстатки.Валюта";
	
	Запрос.УстановитьПараметр("ПериодКонец", Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Истина", Истина);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если НЕ ЗначениеЗаполнено(Выборка.Валюта) Тогда
			Продолжить;
		КонецЕсли;

		СуммаЕсть = Выборка.СуммаОстатокДт - Выборка.СуммаОстатокКт;
		
		Попытка
			Если глЗначениеПеременной("ВалютаМеждународногоУчета") = мВалютаРегламентированногоУчета Тогда
				Если Выборка.Валюта = мВалютаРегламентированногоУчета Тогда
					Множитель = 1;
				Иначе
					Множитель = МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Кратность;
				КонецЕсли;
			Иначе
				Если Выборка.Валюта = мВалютаРегламентированногоУчета Тогда
					Множитель = 1/(МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Кратность);
				Иначе
					Множитель = (МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(Выборка.Валюта, Дата).Кратность) / (МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Курс / МодульВалютногоУчета.ПолучитьКурсВалюты(глЗначениеПеременной("ВалютаМеждународногоУчета"), Дата).Кратность);
				КонецЕсли;
			КонецЕсли;
		Исключение
			Сообщить("Обнаружен нулевой курс валюты!");
			Отказ = Истина;
			Прервать;
		КонецПопытки;
		
		СуммаДолжноБыть = (Выборка.ВалютнаяСуммаОстатокДт - Выборка.ВалютнаяСуммаОстатокКт) * Множитель;
		СуммаРазница = Окр((СуммаДолжноБыть - СуммаЕсть),2);
		
		Если СуммаРазница <> 0 Тогда
			// регистр Международный 
			Движение = Движения.Международный.Добавить();
			Движение.Период = Дата;
			Движение.Организация = Организация;
			
			СрезСведений = РегистрыСведений.СчетаСОсобымПорядкомПереоценкиМеждународный.ПолучитьПоследнее(Дата, Новый Структура("Счет", Выборка.Счет));
			
			Если СуммаРазница > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(СрезСведений.СчетДоходовОтКурсовыхРазниц) Тогда
					Движение.СчетКт = ПланыСчетов.Международный.ДоходОтОперационнойКурсовойРазницы;
					Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиДоходов] = СтатьяДоходовОтКурсовыхРазниц;
				Иначе
					Движение.СчетКт = СрезСведений.СчетДоходовОтКурсовыхРазниц;
					Для Ном = 1 по Движение.СчетКт.ВидыСубконто.Количество() Цикл
						Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[Ном-1].ВидСубконто] = СрезСведений["СубконтоДоходов" + Ном];
					КонецЦикла;
				КонецЕсли;
				
				Движение.СчетДт = Выборка.Счет;
				Движение.ВалютаДт = Выборка.Валюта;
				Для Ном = 1 по Движение.СчетДт.ВидыСубконто.Количество() Цикл
					Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = Выборка["Субконто" + Ном];
				КонецЦикла;
				
			Иначе
				
				СуммаРазница = - СуммаРазница;  // сумма в проводке должна быть всегда положительной
				Если НЕ ЗначениеЗаполнено(СрезСведений.СчетРасходовОтКурсовыхРазниц) Тогда
					Движение.СчетДт = ПланыСчетов.Международный.РасходыОтОперационнойКурсовойРазницы;
					Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоМеждународные.СтатьиЗатрат] = СтатьяРасходовОтКурсовыхРазниц;
				Иначе
					Движение.СчетДт = СрезСведений.СчетРасходовОтКурсовыхРазниц;
					Для Ном = 1 по Движение.СчетДт.ВидыСубконто.Количество() Цикл
						Движение.СубконтоДт[Движение.СчетДт.ВидыСубконто[Ном-1].ВидСубконто] = СрезСведений["СубконтоРасходов" + Ном];
					КонецЦикла;
				КонецЕсли;

				Движение.СчетКт = Выборка.Счет;
				Движение.ВалютаКт = Выборка.Валюта;
				Для Ном = 1 по Движение.СчетКт.ВидыСубконто.Количество() Цикл
					Движение.СубконтоКт[Движение.СчетКт.ВидыСубконто[Ном-1].ВидСубконто] = Выборка["Субконто" + Ном];
				КонецЦикла;
			КонецЕсли;
			
			Движение.Сумма = СуммаРазница;
			Движение.Содержание = "Переоценка валютных статей";
			Движение.НомерЖурнала = "Рег";
		КонецЕсли;
	КонецЦикла;

	Движения.Международный.Записать();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;


	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
